In [60]:
#pip install pandas
import numpy as np
import pandas as pd
dict={'a':10,'b':20,'c':30,'d':40}
label=['a','b','c','d']
data=[10,20,30,40]
arr=np.array(data) # data is numpy array

pd.Series(data=arr,index=label)

a    10
b    20
c    30
d    40
dtype: int32

In [61]:
pd.Series(dict)

a    10
b    20
c    30
d    40
dtype: int64

In [63]:
series=pd.Series([10,20,30,40],['This','is','a','Series'])
series2=pd.Series([1,2,3,4],['this','is','a','series'])
series+series2  # NaN for no match found

Series     NaN
This       NaN
a         33.0
is        22.0
series     NaN
this       NaN
dtype: float64

In [64]:
series['This']

10

In [65]:
np.random.seed(101)
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
type(df['W'])

pandas.core.series.Series

In [67]:
df[['W','Z']] #list of column to select multiple column

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [68]:
df['NEW']=df['W']+df['Z']
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [69]:
df.drop('NEW',axis=1,inplace=True)  # axis 1 to drop column and inplace to change the actual column
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df.shape

(5, 4)

In [71]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [72]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [73]:
df.loc['A','W']

2.706849839399938

In [74]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
df[df['W']>0.5][['X','Y']]  # value of column W greater than 0.5 in rows then  return only X and Y column

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [76]:
df[(df['W']>0) & (df['Y']>0)]  # adding multiple conditions

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df[(df['W']>0) | (df['Y']>0)]  # adding multiple conditions

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
df.reset_index(inplace=True) # pur inplace true and old index will become column in dataframe

In [79]:
coun_list='USA UK UAE IND AUS'.split()

In [80]:
df['Country']=coun_list
df.set_index('Country')

        index         W         X         Y         Z
Country
USA         A  2.706850  0.628133  0.907969  0.503826
UK          B  0.651118 -0.319318 -0.848077  0.605965
UAE         C -2.018168  0.740122  0.528813 -0.589001
IND         D  0.188695 -0.758872 -0.933237  0.955057
AUS         E  0.190794  1.978757  2.605967  0.683509

In [8]:
import pandas as pd
import numpy as np
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
hier_index= pd.MultiIndex.from_tuples(hier_index)
df=pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.426325  0.773122
   2  0.696821 -0.007317
   3 -0.071886  1.230771
G2 1  0.473659  0.747873
   2 -0.479440 -0.602843
   3 -0.236532  1.241305

In [9]:
df.index.names

FrozenList([None, None])

In [10]:
df.xs('G1')

          A         B
1  1.426325  0.773122
2  0.696821 -0.007317
3 -0.071886  1.230771

In [13]:
d={'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[4,5,6]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [18]:
df.dropna(thresh=2)

     A    B  C
0  1.0  3.0  4
1  2.0  NaN  5

In [15]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [16]:
df.fillna(value=2)

     A    B  C
0  1.0  3.0  4
1  2.0  2.0  5
2  2.0  2.0  6

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [25]:
data={'Company':['GOOG','GOOG','NLF','NLF','MS','MS'],
     'Person':['antoine','jack','rose','lucy','remania','russe',],
     'Sales':[600,200,100,300,100,500]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG  antoine    600
1    GOOG     jack    200
2     NLF     rose    100
3     NLF     lucy    300
4      MS  remania    100
5      MS    russe    500

In [26]:
comp=df.groupby('Company')
comp.mean()
comp.sum()

         Sales
Company
GOOG       800
MS         600
NLF        400

In [27]:
comp.max()

        Person  Sales
Company
GOOG      jack    600
MS       russe    500
NLF       rose    300

In [28]:
comp.min()

          Person  Sales
Company
GOOG     antoine    200
MS       remania    100
NLF         lucy    100

In [34]:
#comp.describe().transpose()
#comp.describe().iloc[0]
comp.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOG      2.0  400.0  282.842712  200.0  300.0  400.0  500.0  600.0
MS        2.0  300.0  282.842712  100.0  200.0  300.0  400.0  500.0
NLF       2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0

In [37]:
#Concanating the dataframe
data1={'Company':['REL','GOOG','NLF'],
     'Person':['antoine','jack','rose'],
     'Sales':[600,200,100]}
data2={'Company':['UBER','MSI','MS'],
     'Person':['lucy','remania','russe',],
     'Sales':[900,760,500]}
data3={'Company':['DEL','FB','TRE'],
     'Person':['anita','lucky','rasi'],
     'Sales':[400,300,500]}
df1= pd.DataFrame(data1,index=[0,1,2])
df2= pd.DataFrame(data2,index=[3,4,5])
df3= pd.DataFrame(data3,index=[6,7,8])
pd.concat([df1,df2,df3])

  Company   Person  Sales
0     REL  antoine    600
1    GOOG     jack    200
2     NLF     rose    100
3    UBER     lucy    900
4     MSI  remania    760
5      MS    russe    500
6     DEL    anita    400
7      FB    lucky    300
8     TRE     rasi    500

In [38]:
pd.concat([df1,df2,df3],axis=1)

  Company   Person  Sales Company   Person  Sales Company Person  Sales
0     REL  antoine  600.0     NaN      NaN    NaN     NaN    NaN    NaN
1    GOOG     jack  200.0     NaN      NaN    NaN     NaN    NaN    NaN
2     NLF     rose  100.0     NaN      NaN    NaN     NaN    NaN    NaN
3     NaN      NaN    NaN    UBER     lucy  900.0     NaN    NaN    NaN
4     NaN      NaN    NaN     MSI  remania  760.0     NaN    NaN    NaN
5     NaN      NaN    NaN      MS    russe  500.0     NaN    NaN    NaN
6     NaN      NaN    NaN     NaN      NaN    NaN     DEL  anita  400.0
7     NaN      NaN    NaN     NaN      NaN    NaN      FB  lucky  300.0
8     NaN      NaN    NaN     NaN      NaN    NaN     TRE   rasi  500.0

In [43]:
#Merging the dataframe
data1={'Company':['REL','GOOG','NLF'],
     'Person':['antoine','jack','rose'],
     'Sales':[900,760,500]}
data2={'Turnover':['1M','1.5M','6M','6.5M'],
     'Location':['NW','Washinton','moscow','delhi'],
     'Sales':[900,760,500,700]}
df1= pd.DataFrame(data1,index=[0,1,2])
df2= pd.DataFrame(data2,index=[3,4,5,6])
pd.merge(df1,df2,how='inner',on='Sales')

  Company   Person  Sales Turnover   Location
0     REL  antoine    900       1M         NW
1    GOOG     jack    760     1.5M  Washinton
2     NLF     rose    500       6M     moscow

  Company   Person  Sales Turnover   Location
0     REL  antoine    900       1M         NW
1    GOOG     jack    760     1.5M  Washinton
2     NLF     rose    500       6M     moscow

In [47]:
data1={'Company':['REL','GOOG','NLF'],
     'Person':['antoine','jack','rose'],
     'Sales':[900,760,500]}
data2={'Turnover':['1M','1.5M','6M','6.5M'],
     'Location':['NW','Washinton','moscow','delhi'],
     'Profit':[900,760,500,700]}
df1= pd.DataFrame(data1,index=[0,1,2])
df2= pd.DataFrame(data2,index=[0,1,2,3])
df1.join(df2)

  Company   Person  Sales Turnover   Location  Profit
0     REL  antoine    900       1M         NW     900
1    GOOG     jack    760     1.5M  Washinton     760
2     NLF     rose    500       6M     moscow     500

In [51]:
joined_frame=df2.join(df1)
joined_frame

  Turnover   Location  Profit Company   Person  Sales
0       1M         NW     900     REL  antoine  900.0
1     1.5M  Washinton     760    GOOG     jack  760.0
2       6M     moscow     500     NLF     rose  500.0
3     6.5M      delhi     700     NaN      NaN    NaN

In [52]:
joined_frame['Turnover'].unique()

array(['1M', '1.5M', '6M', '6.5M'], dtype=object)

In [53]:
joined_frame['Turnover'].nunique()

4

In [54]:
joined_frame['Turnover'].value_counts()

1M      1
1.5M    1
6M      1
6.5M    1
Name: Turnover, dtype: int64

In [58]:
joined_frame[(joined_frame['Sales']>700) & (joined_frame['Location']=='NW')]

  Turnover Location  Profit Company   Person  Sales
0       1M       NW     900     REL  antoine  900.0

In [59]:
#Built-in function application
def multiply(x):
    return x*5
joined_frame['Sales'].apply(multiply)

0    4500.0
1    3800.0
2    2500.0
3       NaN
Name: Sales, dtype: float64

In [60]:
joined_frame['Sales'].apply(lambda x: x*5)

0    4500.0
1    3800.0
2    2500.0
3       NaN
Name: Sales, dtype: float64

In [61]:
joined_frame.drop('Sales',axis=1)

  Turnover   Location  Profit Company   Person
0       1M         NW     900     REL  antoine
1     1.5M  Washinton     760    GOOG     jack
2       6M     moscow     500     NLF     rose
3     6.5M      delhi     700     NaN      NaN

In [62]:
joined_frame.columns

Index(['Turnover', 'Location', 'Profit', 'Company', 'Person', 'Sales'], dtype='object')

In [63]:
joined_frame.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [70]:
joined_frame.head()

  Turnover   Location  Profit Company   Person  Sales
0       1M         NW     900     REL  antoine  900.0
1     1.5M  Washinton     760    GOOG     jack  760.0
2       6M     moscow     500     NLF     rose  500.0
3     6.5M      delhi     700     NaN      NaN    NaN

In [64]:
joined_frame.sort_values(by='Sales')

  Turnover   Location  Profit Company   Person  Sales
2       6M     moscow     500     NLF     rose  500.0
1     1.5M  Washinton     760    GOOG     jack  760.0
0       1M         NW     900     REL  antoine  900.0
3     6.5M      delhi     700     NaN      NaN    NaN

In [65]:
joined_frame.isnull()

   Turnover  Location  Profit  Company  Person  Sales
0     False     False   False    False   False  False
1     False     False   False    False   False  False
2     False     False   False    False   False  False
3     False     False   False     True    True   True

In [66]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.31-cp310-cp310-win_amd64.whl (1.6 MB)
     ---------------------------------------- 1.6/1.6 MB 4.9 MB/s eta 0:00:00
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp310-cp310-win_amd64.whl (101 kB)
     -------------------------------------- 102.0/102.0 KB 5.7 MB/s eta 0:00:00
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-1.1.2 sqlalchemy-1.4.31
Note: you may need to restart the kernel to use updated packages.

In [67]:
pip install lxml

Collecting lxml
  Downloading lxml-4.8.0-cp310-cp310-win_amd64.whl (3.6 MB)
     ---------------------------------------- 3.6/3.6 MB 5.1 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-4.8.0
Note: you may need to restart the kernel to use updated packages.

In [68]:
pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     -------------------------------------- 112.2/112.2 KB 2.2 MB/s eta 0:00:00
Requirement already satisfied: webencodings in c:\users\poonamraghuvanshi\appdata\local\programs\python\python310\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: six>=1.9 in c:\users\poonamraghuvanshi\appdata\local\programs\python\python310\lib\site-packages (from html5lib) (1.16.0)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [69]:
pip install BeautifulSoup4

Collecting BeautifulSoup4
  Downloading beautifulsoup4-4.10.0-py3-none-any.whl (97 kB)
     ---------------------------------------- 97.4/97.4 KB 2.8 MB/s eta 0:00:00
Collecting soupsieve>1.2
  Downloading soupsieve-2.3.1-py3-none-any.whl (37 kB)
Installing collected packages: soupsieve, BeautifulSoup4
Successfully installed BeautifulSoup4-4.10.0 soupsieve-2.3.1
Note: you may need to restart the kernel to use updated packages.

In [71]:
sal=pd.read_csv("Salaries.csv")

In [79]:
sal.head(2)
#sal.info()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [78]:
sal['BasePay'].mean()

66325.4488404877

In [80]:
sal['OvertimePay'].max()

245131.88

In [82]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [83]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [86]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [89]:
sal.iloc[sal['TotalPayBenefits'].idxmax()]

Id                                                               1
EmployeeName                                        NATHANIEL FORD
JobTitle            GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
BasePay                                                  167411.18
OvertimePay                                                    0.0
OtherPay                                                 400184.25
Benefits                                                       NaN
TotalPay                                                 567595.43
TotalPayBenefits                                         567595.43
Year                                                          2011
Notes                                                          NaN
Agency                                               San Francisco
Status                                                         NaN
Name: 0, dtype: object

In [91]:
sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [92]:
sal['JobTitle'].nunique()

2159

In [94]:
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [102]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() ==1)

202

In [109]:
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False

sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

477